code-review/NRB_3471_3546/База_Стало/Documents/ПогашениеНКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПогашениеНКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий250</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НКД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/Выписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Выписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЦБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеОтчетаВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеРеестраВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправкиОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПередачиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Comment>На начало(0), На конец операционного дня(1)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Comment>Произвольный текст для вывода в соответствующее поля отчета о совершенной операции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДопИнформацию</Name>
					<Comment>Если требуется заблокировать автоматичсекое обновление поля, то следует установить этот флаг.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ПогашениеНКД/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////////////////
//ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД Тогда
			ДокументОснование	= Основание.Ссылка;			
			Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
			ЦеннаяБумага		= Основание.ЦБ;
			//---
			Если Основание.БанковскийСчет.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
				Биржа	= Справочники.Биржи.MICEX;
			Иначе
				Биржа	= Справочники.Биржи.Внебирж;
			КонецЕсли;
			//---
			ЦенныеБумаги.Очистить();
			//---
			ДанныеДляТЧ	= Основание.ЦенныеБумагиСписываемые.Выгрузить();
			ДанныеДляТЧ.Свернуть("СчетДепо, ЦеннаяБумага", "Количество, Сумма");
			//---
			Для каждого СтрокаТаблицы Из ДанныеДляТЧ Цикл
				НоваяСтрока				= ЦенныеБумаги.Добавить();
				НоваяСтрока.СчетДепо	= СтрокаТаблицы.СчетДепо;
				НоваяСтрока.Депонент	= СтрокаТаблицы.СчетДепо.Владелец;
				НоваяСтрока.ЦеннаяБумага= СтрокаТаблицы.ЦеннаяБумага;
				НоваяСтрока.Количество	= СтрокаТаблицы.Количество;
				НоваяСтрока.НКД			= СтрокаТаблицы.Сумма;
			КонецЦикла; 
		Иначе	                      
			СтандартнаяОбработка = Ложь;
			Сообщить("На основании данного вида поручения нельзя создать документ Погашение НКД!!!");
			Возврат;
		КонецЕсли;			
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если Не ЗначениеЗаполнено(ДокументОснование.БанковскийСчет) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("В документе поручение не заполнен Банковский счет!", Отказ);
		Возврат;
	КонецЕсли;
	РезультатЗапроса	= ПолучитьРезультатЗапросаПоТабличнойЧасти();
	Выборка				= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ДенежныеСредства.ДобавитьПриход();
		Движение.Период			= Дата;
		Движение.БанковскийСчет = ДокументОснование.БанковскийСчет;
		Движение.Депонент		= Выборка.Депонент;
		Движение.Валюта			= Выборка.ВалютаДенежныхСредств;
		Движение.ВалютнаяСумма	= Выборка.ВалютнаяСумма;
		Движение.Сумма			= Выборка.Сумма;
	КонецЦикла;
	СформироватьВыпискиПоПогашениюНКД();
КонецПроцедуры

Процедура СформироватьВыпискиПоПогашениюНКД()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Выписка.Ссылка КАК ВыпискаСсылка,
	|	ПогашениеНКДЦенныеБумаги.СчетДепо			КАК СчетДепо,
	|	ПогашениеНКДЦенныеБумаги.Депонент			КАК СчетДепоВладелец
	|ИЗ
	|	Документ.ПогашениеНКД.ЦенныеБумаги КАК ПогашениеНКДЦенныеБумаги
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.Выписка КАК Выписка
	|ПО
	|	ПогашениеНКДЦенныеБумаги.Депонент = Выписка.СчетДепо.Владелец
	|И
	|	ПогашениеНКДЦенныеБумаги.Ссылка = Выписка.ОперацияЦБ
	|И
	|	ПогашениеНКДЦенныеБумаги.СчетДепо = Выписка.СчетДепо
	|ГДЕ
	|	ПогашениеНКДЦенныеБумаги.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ВыпискаСсылка) Тогда
			ВыпискаОбъект = Выборка.ВыпискаСсылка.ПолучитьОбъект();
		Иначе
			ВыпискаОбъект = Документы.Выписка.СоздатьДокумент();
		КонецЕсли;
		
		Если ВыпискаОбъект.ПометкаУдаления Тогда
			ВыпискаОбъект.ПометкаУдаления = Ложь;
			ВыпискаОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
		
		ВыпискаОбъект.ОперацияЦБ		= Ссылка;
		ВыпискаОбъект.Дата				= Дата;
		ВыпискаОбъект.ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;
		ВыпискаОбъект.ДокументОснование = ДокументОснование;
		ВыпискаОбъект.СчетДепо			= Выборка.СчетДепо;
		ВыпискаОбъект.ВладелецСчета		= Выборка.СчетДепоВладелец;
		ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРезультатЗапросаПоТабличнойЧасти()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПогашениеНКДЦенныеБумаги.Депонент,
	|	ПогашениеНКДЦенныеБумаги.НКД							КАК Сумма,
	|	ПогашениеНКДЦенныеБумаги.ЦеннаяБумага.ВалютаНоминала	КАК ВалютаНоминала,
	|	(ПогашениеНКДЦенныеБумаги.НКД * КурсыВалютСрезПоследнихНоминал.Курс * КурсыВалютСрезПоследних.Кратность) / (КурсыВалютСрезПоследних.Курс * КурсыВалютСрезПоследнихНоминал.Кратность) КАК ВалютнаяСумма,
	|	ПогашениеНКДЦенныеБумаги.Ссылка.ДокументОснование.БанковскийСчет.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств
	|ИЗ
	|	Документ.ПогашениеНКД.ЦенныеБумаги КАК ПогашениеНКДЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	|		ПО ПогашениеНКДЦенныеБумаги.Ссылка.ДокументОснование.БанковскийСчет.ВалютаДенежныхСредств = КурсыВалютСрезПоследних.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследнихНоминал
	|		ПО ПогашениеНКДЦенныеБумаги.ЦеннаяБумага.ВалютаНоминала = КурсыВалютСрезПоследнихНоминал.Валюта
	|ГДЕ
	|	ПогашениеНКДЦенныеБумаги.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	
	Возврат Запрос.Выполнить();
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
